[
    {
        "title": "Şəhla Talıbova recounts trauma of family during Armenian aggression and Khojaly massacre",
        "link": "https://www.azernews.az/aggression/244982.html",
        "thumbnail": "https://www.azernews.az/media/2025/05/22/426x235/trend_court_mehkeme_hakim_161224_2.jpg",
        "author": "Qabil Ashirov",
        "author_img": "https://www.azernews.az/media/2023/01/23/324510177_2993982814239471_8045505945762018295_n_1.jpg",
        "publish_date": "21 July 2025 14:01 (UTC+04:00)",
        "content": [
            "On July 21, at the Baku Military Court, the injured party Şəhla\nTalıbova testified during the trial, stating that she was deported\nfrom her ancestral lands in Armenia in 1988. She said that her\nfamily settled in the Shusha district and later moved to Khojaly\nbecause her husband worked there.",
            "According to Azernews, she recounted that when\nthe pressure against Azerbaijanis began, a stone was thrown at a\nbus, causing a shard of glass to injure her 10-day-old baby's\neye.",
            "She described the difficulties faced during the Khojaly genocide\non the night of February 25-26, 1992, explaining that they barely\nmanaged to escape into the forest, where they stayed for two days\nbefore reaching Aghdam. During the genocide, her father-in-law and\nmother-in-law were held hostage for seven days. Additionally, other\nrelatives were taken hostage, and some remain missing.",
            "“My children suffered severe trauma. After returning to Baku, my\ndaughter would compare stars to rockets. Whenever she saw a star in\nthe sky, she would say, ‘Mom, they are firing rockets, let's\ngo...’,” she added.",
            "It should be noted that the trial of citizens of the Republic of\nArmenia continues in connection with crimes committed as a result\nof Armenia’s military aggression, including crimes against peace\nand humanity, war crimes, preparation and conduct of aggressive\nwar, genocide, violations of war laws and customs, terrorism,\nfinancing terrorism, forcible seizure and retention of power, and\nmany other crimes."
        ]
    },
    {
        "title": "Baku Court hears gripping testimonies of victims in case against Armenian war criminals [PHOTOS]",
        "link": "https://www.azernews.az/aggression/244889.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/18/426x235/17528550504924529412_1200x630.jpg",
        "author": null,
        "author_img": null,
        "publish_date": "18 July 2025 23:52 (UTC+04:00)",
        "content": [
            "On July 18, an open court hearing continued in the criminal case\nagainst citizens of the Republic of Armenia, including Arayik\nHarutyunyan, Arkadi Ghukasyan, Bako Sahakyan, Davit Ishkhanyan,\nDavid Babayan, Levon Mnatsakanyan, and others. They stand accused\nof committing crimes against peace and humanity, war crimes -\nincluding the preparation and conduct of aggressive war, genocide,\nviolations of the laws and customs of war, terrorism, financing of\nterrorism, the forcible seizure and retention of power, and other\nserious offenses stemming from Armenia’s military aggression\nagainst Azerbaijan.",
            "The hearing, held at the Baku Military Court under the\npresidency of Judge Zeynal Aghayev, with Judges Jamal Ramazanov and\nAnar Rzayev (reserve judge Gunel Samadova), ensured that each\ndefendant was provided with an interpreter in their preferred\nlanguage and defense counsel.",
            "The session was attended by the accused, their legal\nrepresentatives, several victims, their legal successors or\nrepresentatives, and state prosecutors.",
            "Judge Zeynal Aghayev introduced the members of the judicial\npanel, prosecutors, interpreters, and others to victims\nparticipating for the first time, explaining their rights and\nobligations under the law.",
            "Victim Orkhan Najafov stated that he was injured due to an\nartillery fire while preventing a large-scale provocation committed\nby the remnants of the Armenian armed forces and illegal Armenian\narmed groups in the direction of Aghdam on September 19, 2023,\nduring anti-terror operations. Responding to questions from public\nprosecutor Tarana Mammadova, he noted that his fellow soldiers -\nIsa Isayev, Ismayil Khanaliyev, Mikayil Hamidli and Sakit Aslanov -\nwho were serving along with him at the time were also injured in\nthe incident.",
            "Another Victim Barzani Atayev mentioned that on September 19,\n2023, while evacuating the wounded as a paramedic at a medical\nstation in the Aghdara district, he was wounded due to a mortar\nshell explosion fired by the enemy. “Although there was a crescent\nsign on the vehicle,” he added.",
            "Ragif Aliyev said that he was injured on September 20, during\nanti-terror operations, when remnants of the Armenian armed forces\nand illegal Armenian armed groups fired his car with a mortar,\nleaving others injured and one person dead.",
            "Responding to the question of the accused David Manukyan, he\nsaid, “The enemy’s goal was to annihilate Azerbaijanis, I do not\nknow their other goals.”",
            "Victim Karam Mammadov said he was captured in Armenia on March\n7, 1990. He drove to the area between the Zangilan and Gafan\ndistricts, on a UAZ vehicle, to restore communication line there.\nHe was accompanied by his employees Baghirov Shakir Avaz oglu and\ndriver Emin, as well as the assistant of the commandant also called\nEmin.",
            "While they were checking the cable lines along the area,\nentering the area of the Gafan communications hub, they were beaten\nand captured by Armenians there. After that, the arriving employees\nof the Gafan District Internal Affairs Department of Armenia and\nmilitary personnel took them to the Gafan District Internal Affairs\nDepartment. Four persons in military uniform tortured them,\ninflicting various types of bodily injuries. As a result, K.\nMammadov's ribs on his right side were broken, all parts of his\nbody were bruised, and he suffered a head injury. Shakir Baghirov\nsuffered a brain bleed.",
            "The soviet soldiers arriving from Zangilan district have taken\nthem over and from Armenians, thus releasing them from captivity.\nThe UAZ vehicle belonging to the victims was appropriated by the\npersons, who captured them in Armenia.",
            "While responding to questions from the state prosecutor, the\nvictim stated that he had undergone treatment in a hospital for two\nmonths.",
            "Jeyhun Aliyev testified that he was injured in the direction of\nJanyatag during the anti-terror operation launched by the\nAzerbaijani Army in 2023, due to a mortar shell explosion fired by\nthe enemy.",
            "In response to a question from public prosecutor Fuad Musayev,\nAliyev said that they were trying to counter the remnants of the\nArmenian armed forces and the provocations of illegal Armenian\narmed groups at that time. “Because they were committing various\nprovocations, firing at our posts and the Azerbaijani civilians,”\nhe added. He also confirmed his statement given to the preliminary\ninvestigation.",
            "Accused Levon Mnatsakanyan inquired about the statements given\nby the victims to the investigation. Judge Zeynal Agayev stated\nthat the statements given by the victims during the preliminary\ninvestigation are also on the tablets in the hands of the\naccused.",
            "Emin Shahbazov testified that on September 19, 2023, he and\nSenior Lieutenant Eshgin Babazada were injured when an anti-tank\nmissile fired by the remnants of the Armenian armed forces and\nillegal Armenian armed groups hit their armored personnel carrier\n(APC) near him in the Aghdara district. Shahbazov also mentioned\nthat he saw the firing of medical vehicles carrying with wounded\nAzerbaijanis. He said that the remnants of the Armenian armed\nforces and illegal Armenian armed groups were staffing positions\nprior to the anti-terror operations.",
            "In response to questions from the public prosecutor Vusal\nAbdullayev, he underlined that the enemy was staffing positions at\nthe time.",
            "Victim Hilal Hasanov testified that he was injured by a bullet\nfired from the remnants of the Armenian armed forces and illegal\nArmenian armed groups in Aghdara district during the anti-terrorist\noperations in 2023. Responding to a question from Tuqay Rahimli,\nAssistant to the Prosecutor General for Special Assignments, his\nfellow servicemen Ali Tagiyev and Javad Maharramov were killed,\nwhile other servicemen Ulvi Karimov, Elsab Karimov, and Nasimi\nMahmudov were injured the enemy fire.",
            "In their testimonies, Safiyar Mahammadli, Shukur Zeynalov and\nElvin Mammadov said that they were injured in the Aghdara direction\nduring the anti-terror operations, and Aligismat Nuriyev was\nwounded in the Khojaly the direction.",
            "Responding to questions from Nasir Bayramov, head of the\nDepartment of Public Prosecution Defense of the Prosecutor\nGeneral's Office, Farid Zeynalov stated that during the anti-terror\noperations in the Aghdam district, a medical vehicle was hit by a\nmissile while on its way to bring wounded servicemen. He and the\nhead of the brigade's medical station, Farhad Tagiyev, were injured\nin the incident.",
            "Ravan Sharifzada testified that he was injured during the\nanti-terror operations - on the night of September 19-20 near the\nVang village.",
            "Victim Nasib Alakbarov stated that on September 13, 2022,\nAzerbaijani military servicemen, whose names he does not remember,\nwere martyred as a result of shell explosion in the Dashkasan\ndistrict, while preventing large-scale provocations by the remnants\nof the Armenian armed forces and illegal Armenian detachments. He\nand several soldiers received various types of bodily injuries.",
            "Victim Imran Bayramov said he was wounded by a grenade, while he\nwas trying to counter an attack in the Kalbajar-Aghdara\ndirection.",
            "Victim Famil Mammadov noted that he, along with other\nAzerbaijani military serviceman were injured in a shooting opened\nby the remnants of Armenian armed forces in the direction of the\nVang village, adding that Ilham Shamsiyev was killed in the\nincident.",
            "Other victims - Elshan Ibrahimli and Tural Mammadov, mentioned\nthey were wounded, while countering the provocation of the remnants\nof Armenian armed forces and illegal Armenian armed detachments in\nthe Aghdam district.",
            "The victims also responded to questions from the accused, their\ndefense lawyers, and representatives.",
            "The trial is scheduled to continue on July 21.",
            "Fifteen defendants of Armenian origin are accused in the\ncriminal case concerning numerous crimes committed during the\naggressive war waged by the Armenian state—including the\naforementioned criminal association—on the territory of Azerbaijan,\nin violation of domestic and international legal norms. These\ncrimes were committed for the purpose of military aggression\nagainst Azerbaijan and were carried out under the direct leadership\nand participation of the Armenian state, officials of its state\ninstitutions, its armed forces, and illegal armed formations,\nthrough their written and verbal orders, instructions, and\nguidelines; material, technical, and personnel support; centralized\nmanagement; as well as under strict control and under the\nleadership and direct or indirect participation of Robert Sedraki\nKocharyan, Serzh Azati Sargsyan, Vazgen Mikaeli Manukyan, Vazgen\nZaveni Sargsyan, Samvel Andraniki Babayan, Vitali Mikaeli\nBalasanyan, Zori Hayki Balayan, Seyran Musheghi Ohanyan, Arshavir\nSurenovich Garamyan, Monte Charles Melkonyan, and others.",
            "The following individuals—Arayik Vladimiri Harutyunyan, Arkadi\nArshaviri Ghukasyan, Bako Sahaki Sahakyan, Davit Rubeni Ishkhanyan,\nDavid Azatini Manukyan, Davit Klimi Babayan, Levon Henrikovich\nMnatsakanyan, Vasili Ivani Beglaryan, Erik Roberti Ghazaryan, Davit\nNelsoni Allahverdiyan, Gurgen Homeri Stepanyan, Levon Romiki\nBalayan, Madat Arakelovich Babayan, Garik Grigori Martirosyan, and\nMelikset Vladimiri Pashayan—are being charged under the following\narticles of the Criminal Code of the Republic of Azerbaijan:\nArticle 100 (planning, preparing, initiating, and waging a war of\naggression); Article 102 (attacking persons or organizations\nenjoying international protection); Article 103 (genocide); Article\n105 (extermination of the population); Article 106 (enslavement);\nArticle 107 (deportation or forced displacement of population);\nArticle 109 (persecution); Article 110 (enforced disappearance of\npersons); Article 112 (deprivation of liberty contrary to\ninternational law); Article 113 (torture); Article 114 (mercenary\nservice); Article 115 (violation of the laws and customs of\nwarfare); Article 116 (violation of international humanitarian law\nduring armed conflict); Article 118 (military robbery); Article 120\n(intentional murder); Article 192 (illegal entrepreneurship);\nArticle 214 (terrorism); Article 214-1 (financing terrorism);\nArticle 218 (creation of a criminal organization); Article 228\n(illegal acquisition, transfer, sale, storage, transportation, and\npossession of weapons, ammunition, explosives, and devices);\nArticle 270-1 (acts threatening aviation security); Article 277\n(assassination of a state official or public figure); Article 278\n(forcible seizure and retention of power, forcible change of the\nconstitutional structure of the state); Article 279 (creation of\narmed groups not provided for by law); and other articles."
        ]
    },
    {
        "title": "Victim held hostage and tortured in Armenia for being Azerbaijani testifies in court",
        "link": "https://www.azernews.az/aggression/244868.html",
        "thumbnail": "https://www.azernews.az/media/2025/05/05/426x235/trend_court_mehkeme_hakim_161224_2.jpg",
        "author": null,
        "author_img": null,
        "publish_date": "18 July 2025 14:24 (UTC+04:00)",
        "content": [
            "On July 18, during a hearing at the Baku Military Court, a\nvictim named Kərəm Mammadov testified that he was held hostage in\nArmenia on March 7, 1990.",
            "As reported by Azernews via AzerTag, he stated\nthat he had travelled to the area between Zangilan and Kapan\ndistricts in a “UAZ” vehicle to restore the communication lines.\nAccompanying him were workers named Shakir Avaz oglu Baghirov, a\ndriver from the Zangilan District Communication Centre named Emin,\nand another man named Emin, who served as the assistant to the\nlocal commandant.",
            "As they were inspecting cable lines and entered the courtyard of\nthe Kapan communication center, Armenians gathered there attacked\nthem, beating Mammadov and the others with punches and kicks, and\ntook them hostage. Later, employees of the Kapan District Internal\nAffairs Department of Armenia and military personnel took them to\nthe department building. There, four Armenians in civilian clothes\ntortured them, inflicting bodily harm through repeated\nbeatings.",
            "As a result, K. Mammadov suffered fractured ribs on his right\nside, extensive bruising across his body, and a traumatic brain\ninjury. Sh. Baghirov experienced a brain hemorrhage.",
            "Soviet soldiers from Zangilan eventually rescued the hostages,\nplacing them in an armoured personnel carrier (“BTR”) and bringing\nthem back to Zangilan. The “UAZ” vehicle they had used was seized\nand appropriated by those who had taken them hostage in\nArmenia.",
            "In response to a question from the prosecutor, Mammadov stated\nthat he was hospitalized for two months due to the injuries he\nsustained in Armenia.",
            "It should be noted that the trial of citizens of the Republic of\nArmenia, accused of crimes arising from Armenia’s military\naggression—including crimes against peace and humanity, war crimes,\npreparation and waging of aggressive war, genocide, violations of\nthe laws and customs of war, as well as terrorism, financing of\nterrorism, seizure of power by force, and other grave offenses—is\nongoing."
        ]
    },
    {
        "title": "Victims injured and taken captive by Armenian armed forces testify in court [PHOTOS]",
        "link": "https://www.azernews.az/aggression/244833.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/17/426x235/17527706092827344315_1200x630.jpg",
        "author": null,
        "author_img": null,
        "publish_date": "17 July 2025 23:21 (UTC+04:00)",
        "content": [
            "On July 17, an open court hearing continued in the criminal case\nagainst citizens of the Republic of Armenia, including Arayik\nHarutyunyan, Arkadi Ghukasyan, Bako Sahakyan, Davit Ishkhanyan,\nDavid Babayan, Levon Mnatsakanyan, and others. They stand accused\nof committing crimes against peace and humanity, war crimes -\nincluding the preparation and conduct of aggressive war - genocide,\nviolations of the laws and customs of war, terrorism, financing of\nterrorism, the forcible seizure and retention of power, and other\nserious offenses stemming from Armenia’s military aggression\nagainst Azerbaijan.",
            "The hearing, held at the Baku Military Court under the\npresidency of Judge Zeynal Aghayev, with Judges Jamal Ramazanov and\nAnar Rzayev (reserve judge Gunel Samadova), ensured that each\ndefendant was provided with an interpreter in their preferred\nlanguage and defense counsel.",
            "The session was attended by the accused, their legal\nrepresentatives, several victims, their legal successors or\nrepresentatives, and state prosecutors.",
            "Judge Zeynal Aghayev introduced the members of the judicial\npanel, prosecutors, interpreters, and others to victims\nparticipating for the first time, explaining their rights and\nobligations under the law.",
            "Victim Aladdin Akbarov testified that he was taken hostage by\nthe enemy in 1990. During two months in captivity, he slept on\nconcrete and, in response to questions from prosecutor Vusal\nAbdullayev, stated that his teeth were broken, his head was\ninjured, and he suffered other injuries. His weight dropped from 87\nkg to 45 kg during captivity.",
            "Idris Mammadov reported being captured in February 1993 during\ncombat. He was held in Azerbaijan’s sovereign territories occupied\nby Armenian forces at the time, including a basement, in Khankendi,\nand Shusha prison. Responding to prosecutor Tarana Mammadova, he\nsaid he endured torture, beatings with batons, fists, and kicks,\nand was given minimal bread and water during his three-month\ncaptivity.",
            "Maarif Rustamov stated he was severely injured during the 44-day\nwar in 2020 in the Murovdagh area of Kalbajar on September 27.\nResponding to prosecutor Nasir Bayramov, he noted two others were\ninjured and four were killed in the incident.",
            "Ilham Asgarov recounted being captured with eight other\nAzerbaijani soldiers in July 1993 in the Aghdara direction. He said\none captive named Azer died due to torture and beatings. Asgarov\nescaped after five months. Responding to Senior Assistant to the\nProsecutor General Vusal Aliyev, he confirmed enduring beatings and\ntorture, with lasting injuries including a broken arm and head\nscars.",
            "Bakhtiyar Jalilov testified that he was injured by sniper fire\nfrom Armenian forces on October 2, 2020, while serving in Kalbajar\nduring the 44-day Patriotic War.",
            "Suleyman Sofuyev said he was injured during the April 2016\nclashes while serving as a soldier. Responding to prosecutor Fuad\nMusayev, he stated the incident occurred while defending against an\nArmenian attack.",
            "Sohrab Asgarov reported being injured on May 12, 2023, in\nKalbajar due to a provocation by Armenian forces. In response to\nSpecial Assistant to the Prosecutor General Tugay Rahimli, he noted\nthat soldier Mahammad Garayev was martyred, and several others were\ninjured.",
            "Teymur Khidirov was injured on November 3, 2020, during the\n44-day war when a shell fired by Armenian forces exploded while he\nwas in a vehicle. The injuries caused severe health issues, making\nit difficult for him to testify.",
            "Imran Imranli stated he was shot and wounded during a\nprovocation by remnants of Armenian forces and illegal Armenian\narmed groups in Kalbajar on the night of July 27–28, 2021.",
            "Renat Aliyev reported receiving a gunshot wound in Tovuz on\nSeptember 14, 2020, due to an Armenian provocation, resulting in\nserious health damage and a 35-day hospitalization.",
            "Shakir Ismayilzade was injured on November 3, 2020, in Tartar\nduring the 44-day war due to a mortar shell explosion fired by\nArmenian forces.",
            "Malid Ganbarov testified that he was injured on November 8,\n2020, in Dashalty by a mortar shell explosion during the 44-day\nwar.",
            "Vusal Mahmudov reported sustaining multiple shrapnel wounds and\nburns on September 27, 2020, the first day of the 44-day Patriotic\nWar.",
            "Etibar Mammadov was captured in 1993 in the Aghdara direction\nand held in Shusha prison for seven months. He testified that he\nand other Azerbaijani captives and hostages endured torture,\nresulting in deaths.",
            "Shirin Bayramov was captured by Armenian forces on January 12,\n1994, and held in Khankendi, including at the former 366th\nregiment’s location, for eight months. He endured regular beatings\nand humiliating treatment, stating, “My nose was broken three times\nand I suffered other injuries.” He escaped with other Azerbaijani\ncaptives and hostages.",
            "Aghagul Bayramov, Shirin’s brother, was captured with him on\nJanuary 12, 1994, and held for two years and five months.",
            "Firangul Karimova, a displaced person from Khojaly and witness\nto the genocide, stated that four of her relatives were killed\nduring the massacre: her father Firuz Samran oglu Karimov,\ngrandfather Samran Soltan oglu Karimov, grandmother Firangul Mammad\ngizi Karimova, and uncle Soltan Samran oglu Karimov. She described\nfinding their bodies on March 20, noting her father was tortured,\nwith his forehead skin peeled off, and her grandmother’s leg\nmissing below the thigh.",
            "Sadig Khudayarov recounted the Khojaly genocide on the night of\nFebruary 25–26, 1992, when he was at his grandfather’s house.\nForced to flee, they encountered enemy forces on February 27. A man\nnamed Mehdi was killed, and his uncle was wounded. His mother\nbecame a second-group invalid due to injuries from a rifle butt,\nand his father suffered broken ribs from torture.",
            "Farzani Najafzade was injured in August 2022 in Hadrut due to a\nmine explosion planted by the enemy.",
            "Zamin Hatamli was injured on December 7, 2023, in the liberated\nKurdlar village of Fuzuli district while plowing land with a\ntractor, due to a mine explosion planted by Armenian forces, which\nalso destroyed the tractor.",
            "Rasul Jafarov was captured with soldier Afig Gasimov on January\n4, 1993, by Armenian forces. Held in Aghdara, Girmizi Bazar, and\nShusha, he endured torture, including boiling water poured on him\nand knife cuts. He stated, “There is no healthy part left on my\nbody.” While held in a farm in Girmizi Bazar, an Armenian named\nArtur broke the jaw of Azerbaijani captive Habil Bayramov, who died\na week later due to injuries and inability to eat. Azerbaijani\ncaptives buried Bayramov’s body near the farm under Armenian\norders. Jafarov was freed on August 24.",
            "Nail Naghizade was wounded on April 2, 2016, in Tartar by sniper\nfire from Armenian forces. In response to accused Levon\nMnatsakanyan, he confirmed the incident occurred during defense\nagainst an Armenian attack.",
            "Jahid Ismayilov was injured on October 2, 2020, in Goygol at a\ncombat post due to a mortar shell explosion fired by the enemy\nduring the 44-day war.",
            "Sabuhi Ibrahimov and Sakhavat Rashidov testified to injuries\nsustained due to provocations by Armenian forces.",
            "Tarzan Musayev reported a closed head injury from a mortar shell\nexplosion on October 10, 2020, during the 44-day war.",
            "Babak Mammadli was injured during the April 2016 clashes in\nTalish village, Shishtapa post. He noted that his twin brother,\nJavidan Mammadli, was killed during the 44-day war, with his body\nreturned after 127 days.",
            "Yasin Mehraliyev was injured by a mine explosion planted by the\nenemy while working for a company in the liberated Sighnag village\nof Khojaly district.",
            "Shamil Mammadov was injured on July 14, 2022, in Dagh Tumas\nvillage of Jabrayil district while transporting wheat for “Azersun”\ndue to the explosion of two anti-tank mines planted by the enemy,\nresulting in the amputation of his left leg.",
            "Vagif Hasanov lived in Khanabad village of Khojaly until 1988,\nwhen he and his four young children were threatened by Armenians\nand forced to flee. He settled in Aghdam, stating, “My two houses\nwere looted.”",
            "The victims also responded to questions from the accused, their\ndefense lawyers, and representatives.",
            "The trial is scheduled to continue on July 18.",
            "Fifteen defendants of Armenian origin are accused in the\ncriminal case concerning numerous crimes committed during the\naggressive war waged by the Armenian state—including the\naforementioned criminal association—on the territory of Azerbaijan,\nin violation of domestic and international legal norms. These\ncrimes were committed for the purpose of military aggression\nagainst Azerbaijan and were carried out under the direct leadership\nand participation of the Armenian state, officials of its state\ninstitutions, its armed forces, and illegal armed formations,\nthrough their written and verbal orders, instructions, and\nguidelines; material, technical, and personnel support; centralized\nmanagement; as well as under strict control and under the\nleadership and direct or indirect participation of Robert Sedraki\nKocharyan, Serzh Azati Sargsyan, Vazgen Mikaeli Manukyan, Vazgen\nZaveni Sargsyan, Samvel Andraniki Babayan, Vitali Mikaeli\nBalasanyan, Zori Hayki Balayan, Seyran Musheghi Ohanyan, Arshavir\nSurenovich Garamyan, Monte Charles Melkonyan, and others.",
            "The following individuals—Arayik Vladimiri Harutyunyan, Arkadi\nArshaviri Ghukasyan, Bako Sahaki Sahakyan, Davit Rubeni Ishkhanyan,\nDavid Azatini Manukyan, Davit Klimi Babayan, Levon Henrikovich\nMnatsakanyan, Vasili Ivani Beglaryan, Erik Roberti Ghazaryan, Davit\nNelsoni Allahverdiyan, Gurgen Homeri Stepanyan, Levon Romiki\nBalayan, Madat Arakelovich Babayan, Garik Grigori Martirosyan, and\nMelikset Vladimiri Pashayan—are being charged under the following\narticles of the Criminal Code of the Republic of Azerbaijan:\nArticle 100 (planning, preparing, initiating, and waging a war of\naggression); Article 102 (attacking persons or organizations\nenjoying international protection); Article 103 (genocide); Article\n105 (extermination of the population); Article 106 (enslavement);\nArticle 107 (deportation or forced displacement of population);\nArticle 109 (persecution); Article 110 (enforced disappearance of\npersons); Article 112 (deprivation of liberty contrary to\ninternational law); Article 113 (torture); Article 114 (mercenary\nservice); Article 115 (violation of the laws and customs of\nwarfare); Article 116 (violation of international humanitarian law\nduring armed conflict); Article 118 (military robbery); Article 120\n(intentional murder); Article 192 (illegal entrepreneurship);\nArticle 214 (terrorism); Article 214-1 (financing terrorism);\nArticle 218 (creation of a criminal organization); Article 228\n(illegal acquisition, transfer, sale, storage, transportation, and\npossession of weapons, ammunition, explosives, and devices);\nArticle 270-1 (acts threatening aviation security); Article 277\n(assassination of a state official or public figure); Article 278\n(forcible seizure and retention of power, forcible change of the\nconstitutional structure of the state); Article 279 (creation of\narmed groups not provided for by law); and other articles."
        ]
    }
]