[
    {
        "title": "Kremlin acknowledges tension in ties with Azerbaijan, responds to lawsuit threat over AZAL plane",
        "link": "https://www.azernews.az/nation/244986.html",
        "thumbnail": "https://www.azernews.az/media/2025/02/16/876x563/peskov.jpg",
        "summary": "Kremlin spokesperson Dmitry Peskov has admitted that Russian-Azerbaijani relations are currently going through a difficult phase, though he emphasized that the bilateral partnership rests on a strong foundation and shared interests.",
        "author": "Akbar Novruz",
        "author_img": "https://www.azernews.az/media/2024/08/29/whatsapp_image_2024-08-29_at_170350.jpg",
        "publish_date": "21 July 2025 14:35 (UTC+04:00)",
        "content": [
            "Kremlin spokesperson Dmitry Peskov has admitted that\nRussian-Azerbaijani relations are currently going through a\ndifficult phase, though he emphasized that the bilateral\npartnership rests on a strong foundation and shared interests.",
            "“Relations between Russia and Azerbaijan have a solid\nfoundation, but sometimes it happens that these relations go\nthrough difficult times, and now is one of those difficult times,”\nPeskov said, noting that Moscow remains hopeful the current period\nof tension will pass.",
            "He highlighted that the cooperation between the two countries is\n“truly mutually beneficial” and stressed the importance of mutual\nrespect.",
            "“It is very important for us that Russians are respected in\nAzerbaijan. A very large Azerbaijani diaspora lives in Russia.\nAlmost all of the representatives of the diaspora are our\nlaw-abiding citizens and enjoy due respect here. Those who violate\nthe laws are held accountable,” he added.",
            "Commenting on Azerbaijani President Ilham Aliyev’s recent\nstatement regarding a potential international lawsuit over the\ncrash of an AZAL passenger plane in Russian airspace, Peskov\nstated: “If Azerbaijan decides to sue Russia in connection with the\ncrash of the AZAL plane, this is their right.”",
            "Note that his remarks come days after President Ilham Aliyev\nconfirmed at the III Shusha Global Media Forum that Azerbaijan is\npreparing legal action against Russia over the downing of an AZAL\nplane."
        ]
    },
    {
        "title": "Azerbaijan leads South Caucasus in patent activity with continued growth in 2024",
        "link": "https://www.azernews.az/nation/244970.html",
        "thumbnail": "https://www.azernews.az/media/2022/12/13/426x235/izobretenie_patent_080519.jpg",
        "author": "Akbar Novruz",
        "author_img": "https://www.azernews.az/media/2024/08/29/whatsapp_image_2024-08-29_at_170350.jpg",
        "publish_date": "21 July 2025 13:25 (UTC+04:00)",
        "content": [
            "Azerbaijan maintained its position as the leader in the South\nCaucasus in patent activity throughout 2024, registering noticeable\nincreases in applications and granted patents across various\nintellectual property categories, Azernews informs\nciting the Intellectual Property Agency.",
            "According to the Agency's mid-2025 report, 310 applications were\nreceived last year for inventions, utility models, and industrial\ndesigns, compared to 302 in 2023. The breakdown includes:",
            "204 invention applications (up from 201)",
            "69 utility model applications (up from 67)",
            "37 industrial design applications (up from 34)",
            "Additionally, 39 applications were submitted to the Eurasian\nPatent Office, while 7 invention applications were filed under the\nPCT international patent system, marking a 12% rise in\ninternational patent outreach compared to the previous year.",
            "The number of patents officially granted also rose notably. In\n2024, a total of 185 patents were registered in the State Register,\nan increase from 151 in 2023. These included:",
            "128 patents for inventions (up from 103)",
            "43 patents for utility models (up from 36)",
            "14 patents for industrial designs (up from 12)",
            "Overall, patent activity grew by 22%, reflecting not only\nincreased innovation and research output but also a stronger legal\nframework supporting intellectual property in Azerbaijan."
        ]
    },
    {
        "title": "New permit system boosts tourism in Azerbaijan’s liberated territories, opens access for foreign visitors",
        "link": "https://www.azernews.az/nation/244974.html",
        "thumbnail": "https://www.azernews.az/media/2024/07/12/426x235/shusha3.jpg",
        "author": "Nazrin Abdul",
        "author_img": "https://www.azernews.az/media/2024/07/25/whatsapp_image_2024-07-25_at_172540.jpg",
        "publish_date": "21 July 2025 12:24 (UTC+04:00)",
        "content": [
            "From July 23, 2025, foreign nationals will be allowed to travel\nto Azerbaijan’s recently liberated territories—including the cities\nof Shusha, Lachin, Aghdam, Fuzuli, Khojaly, and Khankendi—either by\nprivate vehicle or as part of organized groups, provided they\nobtain the necessary permits, Azernews\nreports.",
            "This opportunity applies to visitors staying in Azerbaijan for\nup to 90 days, as well as those with temporary or permanent\nresidence permits.",
            "According to a joint statement from the Ministry of Digital\nDevelopment and Transport and the State Tourism Agency, travelers\nwishing to visit these areas by private car must apply for\npermission through the dedicated “Our Road to Garabagh” portal\n(www.yolumuzqarabaga.az).",
            "The portal supports English and Russian languages and includes\nfields for foreign visitors to enter passport details. Drivers must\nfamiliarize themselves with travel regulations and mine safety\ninformation available on the portal, and ensure all passengers are\ninformed as well. Upon entering the liberated territories, visitors\nare required to stay on designated routes, exercise caution at\njunctions, and strictly adhere to safety guidelines to avoid\nlandmine risks.",
            "Foreign visitors can also access information on hotels and other\naccommodations operating in these regions via the portal.",
            "Group tours to the liberated territories will be organized\nexclusively by tour operators registered with the Tourism\nRegistry.",
            "Furthermore, foreign citizens booking stays at hotels located\nwithin these areas will automatically receive the required access\npermits.",
            "All issued permits will be valid for a period of five days."
        ]
    },
    {
        "title": "President Ilham Aliyev sends congratulatory letter to King Philippe of Belgium",
        "link": "https://www.azernews.az/nation/244967.html",
        "thumbnail": "https://www.azernews.az/media/2025/05/25/426x235/ilham_aliyev_main_photo_200320_2.jpg",
        "author": null,
        "author_img": null,
        "publish_date": "21 July 2025 11:12 (UTC+04:00)",
        "content": [
            "President of the Republic of Azerbaijan Ilham Aliyev has sent a\ncongratulatory letter to King Philippe of the Belgians,\nAzernews reports.",
            "\"Your Majesty,",
            "On my own behalf and on behalf of the people of Azerbaijan, I\nextend my sincerest congratulations and best wishes to you and,\nthrough you, to all your people on the occasion of the national\nholiday of the Kingdom of Belgium,\" the letter reads."
        ]
    },
    {
        "title": "Final day of 3rd Global Media Forum underway in Shusha",
        "link": "https://www.azernews.az/nation/244962.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/21/426x235/trend_global_forum_5.jpg",
        "author": "Nazrin Abdul",
        "author_img": "https://www.azernews.az/media/2024/07/25/whatsapp_image_2024-07-25_at_172540.jpg",
        "publish_date": "21 July 2025 11:02 (UTC+04:00)",
        "content": [
            "The third and final day of the 3rd Shusha Global Media Forum,\ndedicated to the theme “Digital Transformation: Strengthening the\nResilience of Information and Media in the Age of Artificial\nIntelligence,” is currently underway in Shusha,\nAzernews reports.",
            "It should be noted that the forum began on July 19 and concludes\ntoday.",
            "On the final day, panel discussions will focus on key topics\nsuch as media literacy, information security, and the impact of\nsocial media on public trust."
        ]
    }
]