[
    {
        "title": "Armenia cancels registration of so-called \"Nagorno-Garabagh government\"",
        "link": "https://www.azernews.az/karabakh/244846.html",
        "thumbnail": "https://www.azernews.az/media/2023/11/16/876x563/armenia.jpg",
        "summary": "The Armenian Prosecutor General’s Office has filed a legal motion seeking to invalidate the registration of the so-called “Nagorno-Garabagh government’s” permanent representative office in Yerevan, originally granted on January 31, 2007, Azernews reports via Armenian media. The move marks a significant shift in Yerevan’s internal handling of post-conflict dynamics and further distances the Armenian government from structures associated with separatist aspirations in Garabagh.",
        "author": "Akbar Novruz",
        "author_img": "https://www.azernews.az/media/2024/08/29/whatsapp_image_2024-08-29_at_170350.jpg",
        "publish_date": "18 July 2025 11:18 (UTC+04:00)",
        "content": [
            "The Armenian Prosecutor General’s Office has filed a legal\nmotion seeking to invalidate the registration of the so-called\n“Nagorno-Garabagh government’s” permanent representative office in\nYerevan, originally granted on January 31, 2007,\nAzernews reports via Armenian media. The move\nmarks a significant shift in Yerevan’s internal handling of\npost-conflict dynamics and further distances the Armenian\ngovernment from structures associated with separatist aspirations\nin Garabagh.",
            "Responding to questions about the decision, Prime Minister Nikol\nPashinyan made clear that he views the presence of such an entity\non Armenian soil as unacceptable.",
            "“This organization should belong to Armenia,” Pashinyan\nstated.",
            "“I cannot allow the existence of a second state within the\nRepublic of Armenia. I have said this before and I hoped that the\nmessage would be understood. Otherwise, the state must take\naction.”",
            "His remarks reinforce a growing tendency within Yerevan to\ndismantle remnants of parallel authority tied to Garabagh's past\nseparatist structures, especially after the full restoration of\nAzerbaijani sovereignty over the region in 2023.",
            "Many Armenian officials have openly rejected calls to establish\na “Nagorno-Garabagh government in exile,” warning that such a body\ncould serve as a pretext for Azerbaijan to justify future military\nactions against Armenia. The legal step now taken by the Prosecutor\nGeneral signals a further alignment of Armenia’s domestic policies\nwith its international legal obligations and efforts to normalize\nrelations with Baku."
        ]
    },
    {
        "title": "Peace with Azerbaijan nears as Pashinyan embraces realpolitik",
        "link": "https://www.azernews.az/analysis/244757.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/16/426x235/5-17589017345_1.png",
        "author": "Akbar Novruz",
        "author_img": "https://www.azernews.az/media/2024/08/29/whatsapp_image_2024-08-29_at_170350.jpg",
        "publish_date": "16 July 2025 19:50 (UTC+04:00)",
        "content": [
            "After years of ambiguity, hedging, and regional miscalculations,\nArmenian Prime Minister Nikol Pashinyan has delivered what may be\none of his most grounded press conferences to date. On July 16, in\nfront of the Armenian and international press, Pashinyan laid bare\nthe evolving contours of his foreign and domestic policy. He\nappears to understand the structural constraints of Armenian\nforeign policy given the current circumstances. More importantly,\nhe is aware from his own experience that states suffer consequences\nif they ignore the changing power dynamics in their neighbourhood.\nHis message was clear: Armenia must come to terms with regional\nrealities or risk further isolation.",
            "This time, unlike the evasive rhetoric of past years,\nPashinyan’s words were marked by a striking level of political\nsobriety. \"Yes, in 2022, I recognised the territorial integrity of\nAzerbaijan and that Garabagh is part of it. This decision should\nhave been made much earlier,\" the Armenian leader admitted—an\nadmission few of his predecessors dared make. The recognition, he\nadded, stemmed from a basic geopolitical logic: “Armenia cannot\nrecognise its territorial integrity without recognising the\nterritorial integrity of its neighbours.”",
            "Indeed, for a country historically trapped in irredentism and\nromantic nationalism, such realism is commendable. It marks the\nstart, not the end, of a painful but necessary recalibration.",
            "Perhaps the most notable takeaway from the press conference was\nPashinyan’s practical stance on the issue of restoring regional\ntransport and communication corridors with Azerbaijan. “We are\ninterested in restoring bilateral trade relations with Azerbaijan,\nensuring connectivity from Azerbaijan to the territory of Armenia\nor to third countries, as well as ensuring Armenia's access to\nthird countries through the territory of Azerbaijan,” he\nstated.",
            "This goes beyond mere infrastructure—it’s about anchoring\nArmenia’s economic future in reality. Pashinyan even floated the\nidea of transferring the management of the route between Azerbaijan\nand Nakhchivan to a private company, comparing it to the already\noutsourced management of Zvartnots airport. “I do not believe that\nArmenia's jurisdiction or territorial integrity has been violated\nin any way here,” he said.",
            "In doing so, he is attempting to take the emotional sting out of\nregional connectivity projects and reframe them as economic\nopportunities rather than existential threats.",
            "Peace with Türkiye comes as a strategic\nnecessity",
            "Pashinyan’s realism also extends to one of the most emotionally\nand politically charged issues in Armenian public life: the\nrelationship with Türkiye. “If Armenia does not make peace with\nTürkiye, what alternatives are there?” he asked pointedly. “Does\nthat mean we should go to war with a country like Türkiye? Do we\neven understand what we are talking about?” These remarks, while\ndeceptively simple, represent a profound departure from the\nnationalist orthodoxy that has long governed Armenia’s approach to\nits western neighbour.",
            "These rhetorical questions do more than expose the\nimpracticality of confrontation; they challenge a decades-long\npsychological and political framework that equated dialogue with\ndefeatism and any engagement with Türkiye as a betrayal of\nhistorical memory. In posing them, Pashinyan is forcing a national\nreckoning. He is asking Armenians to weigh the cost of sustaining\nhistorical grievance against the cost of geopolitical irrelevance.\nThe implication is stark: clinging to victimhood narratives may\noffer short-term emotional comfort, but it will not ensure\nArmenia’s long-term viability as a sovereign and prosperous\nstate.",
            "Crucially, this shift is not ideological so much as structural.\nArmenia’s diplomatic hostility toward Türkiye, now a resurgent\nregional power, a pivotal NATO member, and a key player in the\nSouth Caucasus, is no longer tenable. Geopolitical reality has\nrendered isolation both unsustainable and strategically reckless.\nTürkiye plays a decisive role in regional energy, trade, security,\nand transportation networks, sectors from which Armenia has long\nexcluded itself through self-imposed diplomatic paralysis.\nReengagement, therefore, is not a concession; it is a prerequisite\nfor survival.",
            "Pashinyan’s rhetorical pivot also signals a broader\ntransformation in Armenian statecraft, from a reactive foreign\npolicy shaped by diaspora pressures and domestic populism to a more\npragmatic, sovereignty-oriented outlook. That such a discourse is\nemerging now reflects both the cumulative cost of past illusions\nand the severity of the current predicament. The collapse of the\nGarabagh project and the rising prominence of regional integration\nefforts have together created a narrow but urgent window for policy\nrecalibration.",
            "Yet, the Prime Minister’s words alone will not suffice.\nNormalising relations with Türkiye demands a deep cultural and\ninstitutional shift, one that can overcome decades of\nstate-sanctioned trauma, entrenched distrust, and political\nresistance from nationalist elites. In that sense, Pashinyan’s\nchallenge is not just diplomatic; it is civilisational.",
            "From Moscow’s shadow to uncertain\nsovereignty",
            "On the regional security front, Pashinyan dropped another\nbombshell, his growing distance from the Moscow-led Collective\nSecurity Treaty Organisation (CSTO). “It is more likely for Armenia\nto withdraw from the CSTO than to freeze its membership,” he noted,\nciting the organisation's failure to meet its obligations.",
            "Armenia has already ceased participation in CSTO activities and\nhas withheld its membership fees. This signals not only\ndisillusionment with Russia but a desire to reorient the country’s\nsecurity policy away from imperial dependency. Is this radical\nshift in his political views really happening? Will Armenia's\nreliance on Russia for years, and its occasional role as a\n\"political pawn or puppet of Russia,\" truly come to an end?",
            "However, such a pivot is not without its costs. Armenia remains\ndeeply economically dependent on Russia. Its society is still\nshaped by Kremlin-leaning media and religious institutions, and its\noligarchic elite, such as the Karapetyan brothers, many with\nRussian ties, are actively resisting reforms, endorsing the former\ngovernment's ideas. Whether Pashinyan can truly wean Armenia off\nthis long-standing dependency remains to be seen.",
            "The peace agreement with Azerbaijan and the only path to\nsurvival",
            "Perhaps the most critical development is that the peace\nagreement with Azerbaijan appears closer than ever. “The text of\nthe Armenia-Azerbaijan project on peace and the establishment of\ninterstate relations has been agreed upon and negotiations on the\ntext have been completed,” Pashinyan declared. What remains is a\nroadmap, possibly involving initialling the deal, and navigating\nthe internal political fallout.",
            "He also noted that Armenia is ready to simplify the transit\nregime through its territory and lamented how some factions have\npainted the reopening of regional railways as a disaster. “I am\nsurprised that some people are trying to present the resumption of\nrailway traffic through the territory of Armenia as a tragedy. The\ntragedy is that there is no transit railway connection through\nArmenia,” he emphasised.",
            "Armenian Prime Minister Nikol Pashinyan has then expressed his\nconfidence in the Abu Dhabi talks as a great platform for the peace\nprocess.",
            "\"Abu Dhabi was the first meeting where both parties agreed in\nadvance on the agenda for discussions and negotiations,\" he stated.\n\"The discussion was very productive, and I hope we can continue\nthis conversation in the same format,\" he expressed.",
            "So is this a real shift in Pashinyan’s political philosophy or\njust tactical manoeuvring? Only time will tell. But one thing is\nclear: he recognises that clinging to outdated narratives no longer\nserves Armenia’s interests. He also knows, painfully, that ignoring\nthe shifting power dynamics of the region has already cost his\ncountry dearly.",
            "That is why Armenia must now move from realism in rhetoric to\nrealism in governance. It must normalise ties with its neighbours,\nespecially Türkiye and Azerbaijan, countries that, unlike Russia,\nare not interested in exploiting Armenia’s vulnerabilities for\nstrategic gain.",
            "This won’t be easy. Armenian society is still deeply traumatised\nby its past and distrustful of its future. Hatred of Turks is still\nsocially acceptable, and the political class remains split between\npeacemakers and provocateurs. If recent history is a guide,\nPashinyan might find it remarkably difficult to mobilise domestic\nsupport to reach his goals in the external arena. Firstly, the\nmajority of the Armenian population still rejects reconciliation\nwith Azerbaijan in the current circumstances. But if there is one\nthing that can tip the scales, it is leadership.",
            "In that sense, Pashinyan's words are not enough, but they are a\nstart. The peace process is underway. Let us hope that, this time,\nit is not sabotaged by nostalgia, nor by fear. Perhaps, a crucial\nelement in achieving lasting peace is the proposed change to the\nreferendum, which seems like the only, if not one of the few\nremaining, unresolved issues. By embracing this change, we can pave\nthe way for a future defined by stability and harmony.",
            "Because peace is not weakness. For Armenia, peace may be its\nonly path to survival."
        ]
    },
    {
        "title": "South Caucasus in focus: Peace, Corridors and Competing Powers [ANALYSIS]",
        "link": "https://www.azernews.az/analysis/244682.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/15/426x235/turkiye_1.png",
        "author": "Elnur Enveroglu",
        "author_img": "https://www.azernews.az/media/2023/02/14/fii-jumo_400x400.jpg",
        "publish_date": "15 July 2025 13:47 (UTC+04:00)",
        "content": [
            "Since the end of the conflict and Armenian occupation of\nGarabagh, the first ever bilateral meeting between Azerbaijani\nPresident Ilham Aliyev and Armenian Prime Minister Nikol Pashinyan\nin Abu Dhabi in July 2025 marks a significant step forward in the\nsearch for a comprehensive peace agreement between the two South\nCaucasus neighbours. Facilitated under the diplomatic auspices of\nthe United Arab Emirates, a rising mediator in global conflicts,\nthe talks have generated cautious optimism among regional watchers\nand international stakeholders alike. Central to the discussions is\nthe long-disputed Zangazur Corridor, a proposed transport route\nthat has drawn in not only Azerbaijan and Armenia, but also the\nUnited States, Russia, Iran, Türkiye, and the European Union.",
            "At its core, the Zangazur Corridor represents more than a\nlogistics route linking Azerbaijan to its exclave of Nakhchivan\nthrough southern Armenia. It is a strategic artery that could\nreshape connectivity across Eurasia, reinforce energy security for\nEurope, and redefine power alignments in the post-Soviet space. In\nAbu Dhabi, for the first time, the Azerbaijani and Armenian leaders\ndiscussed third-party management of the corridor, most notably, a\nUS proposal to control the corridor for 100 years, a move that\nunderscores Washington’s growing interest in countering both\nRussian and Iranian influence in the South Caucasus.",
            "The Zangazur Corridor, if realised, would dramatically shorten\ntrade routes between Central Asia and Europe via the Caspian, South\nCaucasus, and Türkiye. For Armenia, however, the corridor has\nbecome a symbol of lost leverage and a domestic political\nliability, which Pashinyan’s government has tried to rebrand as a\n\"transit route under Armenian sovereignty\", resisting the\n\"corridor\" terminology altogether.",
            "After the bilateral Abu Dhabi meeting, the reported American\nproposal for long-term corridor oversight reflects a deepening of\nsecurity measures. According to diplomatic leaks, the US offered to\nmanage the Zangazur route as an international transport corridor\nunder a 100-year administration model, similar to the historical\nPanama or Suez Canal arrangements. The proposal is driven by a\nsingle factor: ensuring the uninterrupted flow of goods and energy\nfrom Central Asia and the Caspian to European markets.",
            "This overture, however, risks intensifying the Russia-Iran\nalignment, both of which view the corridor through the prism of\ngeostrategic encirclement. Russia’s traditional role as regional\narbiter has diminished following its military overreach in Ukraine,\nbut it still maintains military bases in Armenia. Moscow views the\nUS-led control of the Zangazur Corridor as a direct threat to its\n\"near abroad\" and influence over Yerevan. Iran, meanwhile, sees any\nextraterritorial corridor through Armenian territory as a red line,\nfearing it would cut off its access to the Caucasus and enable a\npermanent NATO-aligned presence on its northern border. Despite all\nthis, from both the Iranian and Western perspectives, the\nsignificance of the Zangazur Corridor is not limited to Eurasia\nalone; it also creates a favourable environment for the safe use of\nthe corridor by Russia and Iran (for civilian commercial purposes)\nin the future.",
            "The Brussels Pivot: Pashinyan’s Calculations and\nMacron’s Agenda",
            "Against this backdrop, Armenian Prime Minister Nikol Pashinyan's\nrecent visit to Brussels and his private meetings with French\nPresident Emmanuel Macron and EU leaders signal Yerevan’s westward\nshift. Publicly, the visit was framed as an effort to deepen\nEU-Armenia political and economic cooperation.",
            "However, behind closed doors, Pashinyan reportedly sought\nguarantees of European support for Armenia’s sovereignty,\nterritorial integrity, and resistance to \"corridor language\" in any\nfuture agreement with Azerbaijan.",
            "France, under Macron, has emerged as Armenia’s most vocal\nEuropean backer, supplying limited arms, training, and consistent\ndiplomatic support. However, Macron’s agenda is not solely\nhumanitarian. France sees the South Caucasus as a front line in the\nwider geopolitical contest between Western liberal democracies and\nrevisionist autocracies, especially given its deteriorating ties\nwith Türkiye and desire to constrain Russian influence. For Macron,\nbacking Armenia also offers a way to reassert French influence in a\nregion where its presence has traditionally been symbolic at\nbest.",
            "There are, however, limits to this strategy. Brussels remains\nreluctant to militarise its engagement and is cautious about\nalienating Azerbaijan, a critical energy partner for the EU.\nPashinyan's overtures to Macron and European leaders thus walk a\nfine line between seeking protection and not pushing the EU into\nopen confrontation with Baku or Ankara. The EU is more likely to\ninvest in connectivity and peacebuilding projects than support\nArmenia in resisting transit arrangements that align with broader\nregional economic integration.",
            "Peace by the end of 2025? Realistic or wishful\nthinking?",
            "The most immediate question is whether a peace agreement between\nAzerbaijan and Armenia is achievable by the end of 2025. Optimists\nargue that the recent flurry of diplomacy points to a narrowing\nwindow of opportunity. The withdrawal of Russian peacekeepers, the\nstabilisation of borders, and the relative calm since late 2023\nhave created conditions for finalising a treaty that normalises\nrelations, delimits the border, and opens transport links.",
            "However, substantial hurdles remain. First, domestic political\nresistance in Armenia, fuelled by nationalist opposition and\ndiaspora lobbying, continues to pressure Pashinyan against making\nconcessions on Zangazur. In particular, the tensions between the\nChurch and the Pashinyan government, the mobilisation of\npro-Russian oligarch Samvel Karapetyan and his pro-Republican Party\nentourage against the authorities, and the artificial escalation of\nunrest in the country are all obstacles preventing Armenia from\ntaking direct and decisive action.",
            "Second, external interference, whether through Iran’s threats,\nRussia’s passive-aggressive manoeuvring, or France’s moral\nposturing, could derail progress. Third, lingering mistrust between\nBaku and Yerevan, particularly regarding the implementation of\nagreements and security guarantees, continues to haunt\nnegotiations.",
            "Nonetheless, the broader regional and global incentives for\npeace are strong. The South Caucasus stands at the intersection of\nmultiple transport, energy, and communication projects that hinge\non stability. Azerbaijan has positioned itself as a reliable energy\npartner and logistical hub; Armenia, though late to pivot, now sees\nthe economic and political benefits of breaking out of its regional\nisolation. If the US and EU can synchronise their approaches, and\nif Iran and Russia are kept at bay diplomatically, a peace deal is\nachievable by early 2026, or perhaps even the end of 2025, but only\nif compromises are reached on the Zangazur Corridor and border\nrecognition."
        ]
    },
    {
        "title": "Washington proposes 100-year lease on Zangazur Corridor to break South Caucasus deadlock",
        "link": "https://www.azernews.az/karabakh/244660.html",
        "thumbnail": "https://www.azernews.az/media/2023/10/19/426x235/zangezur-corridor.jpg",
        "author": "Akbar Novruz",
        "author_img": "https://www.azernews.az/media/2024/08/29/whatsapp_image_2024-08-29_at_170350.jpg",
        "publish_date": "14 July 2025 18:34 (UTC+04:00)",
        "content": [
            "The United States has confirmed its proposal to take over\nmanagement of the long-contested Zangazur Corridor between Armenia\nand Azerbaijan, in a bid to break the deadlock in peace\nnegotiations between the two countries, according to remarks by\nU.S. Ambassador to Türkiye Tom Barrack, as reported by Azernews via\nMiddle East Eye.",
            "For a peace deal, one of the core points of contention remains\nArmenia’s refusal to recognize or use the term Zangazur Corridor,\nwhich it views as a challenge to its territorial sovereignty over\nthe Syunik region. Azerbaijan, however, has made clear that it\ncannot accept the route remaining under Armenia’s full control due\nto concerns over long-term accessibility and security.",
            "The proposed 32-kilometer corridor would connect mainland\nAzerbaijan with its exclave Nakhchivan via southern Armenia,\nfacilitating strategic trade and transit across the South Caucasus.\nBut disagreement over the corridor’s status and oversight has\nsignificantly slowed progress on the peace deal.",
            "\"They are arguing over 32 kilometers of road, but this is no\ntrivial matter. It has dragged on for a decade—32 kilometers of\nroad,\" Ambassador Barrack stated during a briefing in New York.",
            "“So what happens is that America steps in and says: ‘Okay, we’ll\ntake it over. Give us the 32 kilometers of road on a hundred-year\nlease, and you can all share it’,” he added, confirming for the\nfirst time that the Trump administration had floated a proposal for\nU.S. management through a neutral commercial operator.",
            "The idea reportedly follows a model discussed earlier by the EU,\nin which a private logistics company would oversee transit on the\ncorridor while transparently sharing data with both Baku and\nYerevan.",
            "Barrack's comments mark the first official confirmation that the\nTrump administration offered to manage the corridor through a\nprivate US commercial operator, which would serve as a neutral\nguarantor.",
            "A recent report by Carnegie Endowment suggested that the plan is\nmodelled on an earlier European Union proposal, which would put a\nUS logistics firm in charge of managing and monitoring cargo\ntransit along the route, sharing data transparently with all\nparties.",
            "The report noted that the proposal draws on precedents of\ninternational oversight in Georgia’s breakaway regions, aiming to\naddress Baku's demand for robust, long-term security guarantees\nwhile preserving Yerevan’s sovereignty over the corridor.",
            "A regional source cited by Middle East Eye revealed that Türkiye\noriginally proposed the idea of an international company managing\nthe corridor, but Armenia’s condition that the same company operate\non the Nakhchivan side proved unacceptable to Baku.",
            "The corridor remains a vital piece of the Middle Corridor\ninitiative that aims to link Türkiye to Central Asia through the\nSouth Caucasus, bypassing Russia and Iran. Turkish businesses are\nalso eager to engage in Armenia’s reconstruction and infrastructure\ndevelopment, contingent on normalization.",
            "The future of the Zangazur Corridor—and broader regional\nintegration—still hinges on whether Armenia will concede to a\nshared or international oversight mechanism. Until then, the\ncorridor remains the single most significant obstacle to lasting\npeace between Baku and Yerevan."
        ]
    },
    {
        "title": "EU expresses hope for swift signing of Azerbaijan-Armenia peace treaty",
        "link": "https://www.azernews.az/karabakh/244639.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/14/426x235/5451862019474062069.jpg",
        "author": "Akbar Novruz",
        "author_img": "https://www.azernews.az/media/2024/08/29/whatsapp_image_2024-08-29_at_170350.jpg",
        "publish_date": "14 July 2025 15:06 (UTC+04:00)",
        "content": [
            "The European Union views the draft peace treaty between\nAzerbaijan and Armenia as a historic turning point that could\nfinally put an end to decades of conflict, European Commission\nPresident Ursula von der Leyen said during her meeting with\nArmenian Prime Minister Nikol Pashinyan, Azernews\nreports.",
            "“I hope that the agreement will be signed as soon as possible,”\nvon der Leyen stated, emphasizing the EU’s full support for the\npeace process.",
            "Highlighting the growing ties between Brussels and Yerevan, the\nEC President noted that relations are now “closer than ever” and\nunderscored the ambitious nature of the EU-Armenia partnership\nagenda.",
            "“We have a sustainability and development plan, which envisages\nproviding Armenia with 270 million euros,” she added."
        ]
    }
]