[
    {
        "title": "Germany’s energy future under strain as power shortage looms",
        "link": "https://www.azernews.az/region/244958.html",
        "thumbnail": "https://www.azernews.az/media/2024/10/15/426x235/history-of-electricity-article-image-of-electric-powerlines.jpg",
        "summary": "Germany could face a serious electricity shortage in the coming years, as its current renewable energy trajectory may not be sufficient to meet national demand, Azernews reports via Bild.",
        "author": "Akbar Novruz",
        "author_img": "https://www.azernews.az/media/2024/08/29/whatsapp_image_2024-08-29_at_170350.jpg",
        "publish_date": "21 July 2025 09:45 (UTC+04:00)",
        "content": [
            "Germany could face a serious electricity shortage in the coming\nyears, as its current renewable energy trajectory may not be\nsufficient to meet national demand, Azernews\nreports via Bild.",
            "According to the newspaper, both the Ministry of Economics and\nthe country’s industrial sector are expressing growing doubts about\nthe feasibility of relying solely on unlimited expansion of wind\nand solar power.",
            "Economy Minister Katarina Reich stressed that the focus should\nshift from merely building more renewables to modernizing and\nexpanding the country’s electricity grid. She noted that the\nrequired overhaul of Germany’s power grid by 2045 could cost\napproximately €600 billion — a price tag she acknowledged as “very\nexpensive.”",
            "Germany’s challenge is further complicated by its plan to\ncompletely phase out coal-powered electricity by 2038 at the\nlatest. With renewable energy sources unable to fully fill the gap,\nReich indicated that natural gas power plants could become a\ncrucial part of the transitional strategy.",
            "To this end, the minister announced plans to launch a tender for\nthe construction of new gas power plants later this year, in hopes\nof securing a stable and flexible energy supply for the future."
        ]
    },
    {
        "title": "South Korea’s Hanwha Eyes U.S. navy shipbuilding deal amid $20 billion defense boost",
        "link": "https://www.azernews.az/region/244943.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/20/426x235/aen20250720002000320_02_i_p4.jpg",
        "author": null,
        "author_img": null,
        "publish_date": "21 July 2025 09:00 (UTC+04:00)",
        "content": [
            "Hanwha Philly Shipyard, owned by South Korea's\nchemicals-to-shipbuilding conglomerate Hanwha Group, is considering\nbidding for the U.S. Navy's combat support ship construction\nproject, the group said Sunday, Azernews reports,\nciting Yonhap.",
            "At a recent media briefing in Philadelphia, the shipyard's CEO\nDavid Kim said Hanwha is in \"discussions\" about participating in\nthe project.",
            "An additional U.S. defense budget of more than US$20 billion has\nbeen approved for the construction of combat and support ships, he\nsaid, adding the Senate and House of Representatives are discussing\nhow to execute the funding.",
            "Some of the planned combat support ships are the type of vessels\nHanwha is capable of building, which is why the company needs to\nwin the bid, Kim said.",
            "The company is already preparing documents for submission to the\nU.S. Navy and getting ready for the bidding process, he added.",
            "Hanwha Group acquired Philly Shipyard Inc. for $100 million last\nyear as part of its global expansion strategy.",
            "Through the acquisition, Hanwha aims not only to enter the\nmarket for building 3,600 twenty-foot equivalent unit (TEU)\nliquefied natural gas-powered container carriers and LNG ships but\nalso to win contracts to supply components for U.S. Navy vessels\nand potentially build Navy ships in the long term.",
            "\"The U.S. defense budget focuses on combat ships, nuclear\nsubmarines and aircraft carriers. But a fleet cannot go into battle\nwith only attack vessels. It needs support ships as well,\" said Lee\nJong-moo, head of Hanwha Philly Shipyard.",
            "\"U.S. support shipbuilding capability has weakened and fallen\nbehind schedule, so the U.S. is considering placing orders with\nforeign shipyards if support ships can be built quickly,\" he\nadded.",
            "U.S. President Donald Trump has emphasized the need to revive\nthe U.S. shipbuilding industry and the importance of partnering\nwith allies, including South Korea, a global leader in naval vessel\nconstruction.",
            "In April, U.S. Secretary of the Navy John Phelan visited Hanwha\nOcean Co.'s shipyard in Geoje, about 330 kilometers south of Seoul,\nto discuss cooperation in naval defense. Trump's eldest son, Donald\nTrump Jr., also visited Seoul that month for meetings with Hanwha\nofficials, including Hanwha Group Vice Chairman Kim Dong-kwan, to\nexplore potential partnerships."
        ]
    },
    {
        "title": "Baku’s green push extends to Italy’s sunbelt",
        "link": "https://www.azernews.az/analysis/244921.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/19/426x235/12.jpg",
        "author": "Qabil Ashirov",
        "author_img": "https://www.azernews.az/media/2023/01/23/324510177_2993982814239471_8045505945762018295_n_1.jpg",
        "publish_date": "21 July 2025 08:30 (UTC+04:00)",
        "content": [
            "In an increasingly carbon-conscious world, Azerbaijan is making a bold and visionary leap into the future. With the State Oil Fund of Azerbaijan (SOFAZ, or ARDNF in Azerbaijani) acquiring a 49% stake in 402 megawatts of solar energy assets in Italy through a partnership with U.S.-based Enfinity Global Inc., Baku is sending a clear message: our energy expertise does not end at hydrocarbons, and our commitment to sustainable development is global in scale.",
            "Find the plan that suits you best.",
            "Full digital access to all news for 1 month",
            "Full digital access to all news for 3 months",
            "Full digital access to all news for 6 months",
            "Full digital access to all news for 1 year"
        ]
    },
    {
        "title": "Italy’s inflation remains below ECB target in June",
        "link": "https://www.azernews.az/region/244931.html",
        "thumbnail": "https://www.azernews.az/media/2024/09/18/426x235/inflation.jpg",
        "author": null,
        "author_img": null,
        "publish_date": "21 July 2025 08:00 (UTC+04:00)",
        "content": [
            "According to the Italian National Institute of Statistics (ISTAT), the country’s annual inflation rate reached 1.7% in June, Azernews reports.",
            "Find the plan that suits you best.",
            "Full digital access to all news for 1 month",
            "Full digital access to all news for 3 months",
            "Full digital access to all news for 6 months",
            "Full digital access to all news for 1 year"
        ]
    }
]