[
    {
        "title": "Film-makers Union announces screenwriting contest",
        "link": "https://www.azernews.az/culture/244979.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/21/426x235/17530823525396941462_1200x630.jpg",
        "summary": "Azerbaijan Union of Film-makers (AUF) has announced the full-length feature film screenwriting contest titled \"I Am a Woman\", Azernews reports.",
        "author": "Laman Ismayilova",
        "author_img": "https://www.azernews.az/media/2023/08/17/laman.jpg",
        "publish_date": "21 July 2025 15:09 (UTC+04:00)",
        "content": [
            "Azerbaijan Union of Film-makers (AUF) has announced the\nfull-length feature film screenwriting contest titled \"I Am a\nWoman\", Azernews reports.",
            "A total of 96 scripts were submitted for the competition, of\nwhich 71 were accepted for consideration.",
            "Since January, regular masterclasses have been organized for\nparticipants. The noticeable increase in the number of female\nauthors among the finalists indicates the effectiveness of the\nefforts carried out in this direction.",
            "The winners of the competition are expected to be announced by\nAugust 2. The first-place winner will receive a cash prize of 5,000\nAZN (2,950 USD), the second-place winner will be awarded 3,500 AZN\n(2,058 USD), and the third-place winner will receive 2,500 AZN\n(1,471 USD). All winners will also be presented with diplomas.",
            "Taking into account the active role of Azerbaijani women in all\nspheres of society- economic, military, diplomatic, social, and\ncultural, the project aims to promote the increased representation\nof both female authors and female protagonists in cinema.",
            "Founded in 2012, the Azerbaijan Film-Makers Union (AUF) focuses\non the development of local cinema as an integral part of national\nculture and world cinema.",
            "Azerbaijani cinema has come to be an internationally recognized\nmodern art, enjoying huge popularity and recognition at\ninternational film festivals, which frequently award the national\nfilms.",
            "Over the past years, more than 300 films and 1,200\ndocumentaries, as well as hundreds of cartoons, were filmed.",
            "The Azerbaijan Union of Film-makers is a member of the\nConfederation of Unions of Cinematographers of the CIS and Baltic\nStates.",
            "The history of the film industry in Azerbaijan spans over 100\nyears. Over this time, the local film companies have produced\nhundreds of films.",
            "Following the Lumiere brothers' invention of the cinematograph\nin 1895, Russian photographer and cameraman Alexandre Michon began\nfilming motion pictures showcasing daily life in Baku.",
            "The first silent short film of the Azerbaijani cinematography\ntitled \"You are caught\", premiered in Baku in August 1898, marked\nthe birth of Azerbaijani cinema.",
            "At the beginning of the last century, foreign film companies\nsuch as Pathé, the Pirone Brothers Society, and Film opened their\nbranches in Baku and began producing films.",
            "In 1916, a short film called \"In the Kingdom of Oil and\nMillions\" was shot based on the novel of the same name by writer\nIbrahimbek Musabayov, and in 1917, \"The Cloth Peddler\" was produced\nbased on the operetta by Uzeyir Hajibayli.",
            "After the establishment of Soviet power in Azerbaijan in 1923,\nthe Azerbaijan Photo and Film Administration (APFA).",
            "The first state film factory started operating on April 28 of\nthe same year. The first film shot here was the feature film\n\"Maiden Tower\", based on a folk legend.",
            "Today, local film companies are producing dozens of films that\nhave gained international acclaim.",
            "The film production industry in the country is rapidly\nexpanding, making it possible for a multitude of filmmakers to\nexpress themselves in different ways."
        ]
    },
    {
        "title": "ICESCO's Regional Office explores strengthening ties [PHOTOS]",
        "link": "https://www.azernews.az/culture/244877.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/18/426x235/eirfjreferf8.jpg",
        "author": "Laman Ismayilova",
        "author_img": "https://www.azernews.az/media/2023/08/17/laman.jpg",
        "publish_date": "18 July 2025 19:00 (UTC+04:00)",
        "content": [
            "The first seminar dedicated to cooperation in the fields of\nculture, education, and science has been organised at the Regional\nOffice of the Islamic World Educational, Scientific and Cultural\nOrganisation (ICESCO) in Baku, Azernews\nreports.",
            "The main task of ICESCO's regional office in Baku, which opened\non April 29, 2025, is to coordinate cooperation between the\ncountries of the Caucasus and Central Asia – Azerbaijan,\nUzbekistan, Tajikistan, Kazakhstan, and Kyrgyzstan.",
            "This region is home to unique cultural treasures, ranging from\nthe Great Silk Road to various examples of intangible heritage, and\nis capable of playing a significant role in shaping the global\ncultural landscape.",
            "Abdulhakeem Al-Senan, the Director of ICESCO's Regional Office\nin Baku, opened the event with a welcoming speech. He thanked all\nthose who contributed to the organisation of the seminar.",
            "In his speech, he emphasised that the Regional Office in Baku\nwas established to strengthen ICESCO's presence in the Caucasus and\nCentral Asia, as well as to assist in fostering closer cooperation\nbetween member states.",
            "\"This office is not just a structural unit of ICESCO, but also a\nfully-fledged and strong centre. It serves as a direct link between\nthe organisation's headquarters and all member countries,\ncontributing to the implementation of national plans and the\ndevelopment of education, science, and culture,\" the director\nsaid.",
            "He also expressed his gratitude to the partner countries –\nUzbekistan, Tajikistan, Kazakhstan, and Kyrgyzstan – for their\nsupport in the establishment of the office.",
            "Farid Jafarov, Azerbaijan's Deputy Minister of Culture,\nemphasised that the opening of ICESCO's regional office is of\nspecial significance, as its activities will cover a wide range of\nareas, from education and culture to information technology.",
            "The Deputy Minister stressed that special attention would be\ngiven to the cultural field, in which Azerbaijan has traditionally\nbeen highly active. According to him, in recent years, the country\nhas been actively collaborating with international experts in the\ncultural sector, which remains one of the priorities of state\npolicy.",
            "Farid Jafarov also recalled that ICESCO's cooperation with\nAzerbaijan extends to the Karabakh region. This collaboration is\nbeing carried out not only at the state level but also with the\ninvolvement of non-governmental organisations and the private\nsector.",
            "He also mentioned that last year, ICESCO, with the support of\nthe international community, was a partner in a project implemented\njointly with Azerbaijani counterparts, focusing specifically on\necological issues.",
            "Furthermore, he reminded that ICESCO declared the ancient city\nof Shusha, located in Azerbaijan's recently liberated territory,\nthe Capital of Islamic Culture for 2024.",
            "\"During this period, we held several international events to\nmark this significant occasion, both in Shusha and other regions of\nAzerbaijan,\" the Deputy Minister added.",
            "Anar Karimov, ICESCO's Director of International Cooperation,\nthen spoke and noted that the Baku office, with its rich and\ndiverse heritage, would be a \"beacon\" for the organisation in the\nregion. \"We are talking about creating a new cooperation platform\nbased on peace, mutual respect, and a shared vision for the\nfuture,\" he emphasised.",
            "Karimov presented three proposals by ICESCO regarding regional\nintegration. He stated: \"First, we propose the creation of a\nunified regional cluster, supported by ICESCO and other partners,\nwhich will connect the countries of the region. This cluster will\nfocus on two broad areas: cultural heritage, science and\ninnovation, climate resilience, and curriculum development.\"",
            "He also mentioned that the regional office in Baku would hold a\nseminar on the protection of cultural heritage on July 28 of this\nyear. This important initiative will bring together experts and\norganisations to identify ways of safeguarding and promoting both\ntangible and intangible heritage. Additionally, other centers will\nbe created to take leadership in the fields of education,\ninnovation, \"green\" science, multilingual digital content, and\npublishing, ensuring institutional leadership and balanced\nparticipation from all countries in the region.",
            "Finally, Maryam Qafar-zadə, Deputy Director of ICESCO's Regional\nOffice in Baku, addressed the audience. She spoke about the\norganization's mission, emphasizing that its primary goal is to\nstrengthen the capacities of regional countries by providing access\nto programs and projects aimed at developing education and science,\nprotecting cultural heritage, empowering youth and women, promoting\ncultural dialogue, and preserving the environment.",
            "As part of the event, a video was presented to the seminar\nparticipants, highlighting the history of ICESCO's establishment,\nwhen and which countries joined the organization, as well as its\nkey initiatives and areas of activity in a global context.",
            "In this regard, the regional seminar has become an effective\nplatform for enhancing cooperation between Azerbaijan, Uzbekistan,\nTajikistan, Kazakhstan, and Kyrgyzstan.",
            "The aim of the meeting was to deepen regional integration and\npromote ICESCO's mission of strengthening connections between\ncountries through education, science, and culture.",
            "The seminar continued with panel discussions. Representatives\nfrom the participating countries exchanged experiences and ideas,\npresenting their proposals on how to develop cooperation in the\nfields of culture, science, and education.",
            "The seminar participants put forward specific initiatives to\nstrengthen regional partnership, emphasising the importance of\nclose collaboration and joint efforts to achieve common goals.",
            "With its rich cultural legacy, Azerbaijan joined the Islamic\nWorld Educational, Scientific, and Cultural Organisation (ICESCO)\nin 1991.",
            "Since then, Azerbaijan has actively promoted the preservation of\nits Islamic cultural heritage.",
            "The country successfully collaborates closely with various\norganisations, including the Organisation of Islamic Cooperation,\nthe Islamic Development Bank, the Islamic Conference of\nParliamentary Union, and the Islamic Conference of Youth Forum."
        ]
    },
    {
        "title": "Azerbaijani filmmakers discuss strategies for success at international festivals [PHOTOS]",
        "link": "https://www.azernews.az/culture/244862.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/18/426x235/jeiofjerfrhy9.jpg",
        "author": "Laman Ismayilova",
        "author_img": "https://www.azernews.az/media/2023/08/17/laman.jpg",
        "publish_date": "18 July 2025 17:56 (UTC+04:00)",
        "content": [
            "Azerbaijan's film industry is undergoing an exciting\ntransformation, marked by an emerging generation of young\nfilmmakers eager to make their mark on the international stage.",
            "With growing participation in prominent film festivals and an\nincreasing focus on co-productions, Azerbaijani cinema is steadily\ngaining global attention.",
            "Recent initiatives, such as workshops, industry discussions, and\nfilm projects showcased at international festivals, are helping to\nrefine the craft and establish Azerbaijan as an emerging hub for\ncinematic talent.",
            "A discussion titled \"What Films Are Festivals Expecting from\nUs?\" was held at the Union of Cinematographers of Azerbaijan,\nfeaturing young directors and screenwriters,\nAzernews reports.",
            "The discussion was attended by film critic Haji Safarov,\ndirectors Turkan Huseyn and Nurlan Hasanli. Haji Safarov has\nparticipated as a film critic in prestigious festivals such as San\nSebastián and Cannes.",
            "The projects of Turkan Huseyn and Nurlan Hasanli have been\nshowcased at various international workshops and participated in\nscript development programs. Video presentations from young\ndirectors were shown to the guests.",
            "Film critic and moderator Sevda Sultanova noted that the focus\nof the discussion was on participation in international film\nfestivals, ways to achieve success in this field, and identifying\npriorities. She posed the question to the participants about the\nvery concept of \"festival cinema.\"",
            "\"We sometimes have a misconception that festival cinema cannot\nbe commercial, that it is not aimed at wide distribution, and that\nit must include long, static shots. However, practice shows the\nopposite. What does 'festival cinema' actually mean, and what\nshould authors pay attention to?\" the moderator inquired.",
            "Haji Safarov emphasized that a festival is, first and foremost,\na powerful tool for promoting national values, history, and\nculture, as well as contemporary life and society, to a broad\ninternational audience.",
            "\"A festival gives a film the opportunity to reach the\ninternational stage. It can be of any genre—what matters is finding\nthe right audience for it. Films do not make it to major festivals\nby accident. Companies invest in films with the intention of\nshowcasing them on various platforms and achieving commercial\nsuccess. Therefore, preference is given to films with artistic\nvalue, speaking a universal language, and possessing originality.\nThe main goal is to enter the global film market,\" said the film\ncritic.",
            "Turkan Huseyn noted that a festival is a place where the\ndirector meets the audience. Regardless of the genre, any film can\nbe presented at a festival.",
            "\"It is a very fruitful platform for promoting various ideas.\nFirst and foremost, you find your audience. A festival serves as a\ntool for continuing the work, establishing direct contact, gaining\nrecognition, and, at the same time, a well-organized budget is a\nsignificant factor. You must clearly understand which funds you can\napproach with a specific project. If the budget is too small, you\nmay not be taken seriously. The budget must be realistic,\"\nemphasized the director.",
            "In his speech, Nurlan Hasanli highlighted the importance of\ninternational collaboration.",
            "\"Rustam Ibrahimbayov rightly wrote that for countries with small\nfilm markets, participation in co-productions is essential for\nentering the global arena. The production companies involved in the\nprocess take an interest in the films and help them reach\ninternational markets. The second important factor is the intensity\nof production within the country,\" noted the director.",
            "According to him, each festival has its own criteria. These\ninclude the fame of the team and the director's reputation. If the\ndirector is a newcomer, the plot and theme attract attention. The\ncurrent trend—whether it's a topic or a region matters. For\nexample, films from countries involved in armed conflicts always\ndraw interest.",
            "\"From my experience: my documentary film was included in several\nprograms because it incorporated elements of humour. Among 15\ndocumentaries, where 14 were dramas, my film, being the only\ncomedy, ended up being the final one, so the audience would leave\nwith a good mood. Uniqueness is what attracts. Making a good film\nis just the beginning of the journey. You must go through many\nstages: collaboration with co-producing companies, promoting the\nproject, working with major distributors, and so on,\" he added.",
            "It was noted that to participate in projects, a good command of\nEnglish is essential, as well as the ability to properly prepare a\nproject: logline, synopsis, director's and producer's\nstatement.",
            "Knowledge of the project's structure is a key element. Previous\nachievements are taken into account when submitting applications to\nfestivals, so it's advisable to start with local and regional\nprograms.",
            "The discussions continued with the evening's guests, addressing\nquestions and proposals."
        ]
    },
    {
        "title": "Musical Theater concludes its season with Uzeyir Hajibayli's masterpiece [PHOTOS]",
        "link": "https://www.azernews.az/culture/244871.html",
        "thumbnail": "https://www.azernews.az/media/2025/07/18/426x235/kopkpferferf1.jpg",
        "author": "Laman Ismayilova",
        "author_img": "https://www.azernews.az/media/2023/08/17/laman.jpg",
        "publish_date": "18 July 2025 17:32 (UTC+04:00)",
        "content": [
            "The Azerbaijan State Academic Musical Theater has concluded its\n115th season with a spectacular performance of Uzeyir Hajibayli's\nmusical comedy \"If Not That One, Then This One\",\nAzernews reports.",
            "This evening was not just the season finale, it was also\ndedicated to the 140th anniversary of the great composer, the\nfounder of modern professional musical art in Azerbaijan, and\nmusicologist Uzeyir Hajibayli.",
            "The performance had special significance, as the play itself is\nalready 115 years old.",
            "The musical comedy (operetta), written in 1910, reflects the\nsocial and domestic relationships in pre-revolutionary Azerbaijan.\nThis was the composer's second work in this genre.",
            "Along with his third operetta, \"The Cloth Peddler\" is also\nconsidered a national classic.",
            "Since its debut, it has been successfully presented not only in\nAzerbaijan but also on international stages, as well as in the form\nof a film.",
            "The audience erupted in applause and enthusiastic exclamations,\nand after the performance, the cast gathered backstage to reflect\non and proudly recall all the bright and important moments of the\nseason, as well as to wish each other new creative victories.",
            "The director of the production was People's Artist Jannet\nSalimova, who has been carefully preserving and developing this\nlegendary play since 1998.",
            "The musical part was led by honored artists, conductors Nazim\nHajibayov and Fakhraddin Atayev.",
            "The set designer was honored artist Ismail Mammadov, and the\nchoirmaster was Honored Artist Vagif Mastanov. The choreographers\nwere the Honored artists Zakir Aghayev and Leyla Aghayeva.",
            "People's Artist Perviz Mammadrzayev, Honored Artists Shovgi\nHuseynov, Azizaga Azizov, Nadir Hasiyev, Nahida Orujova, as well as\nactors Shaban Jafarov, Elhan Ismayilov, Elchin Imamov, Huseyn\nAlili, Turkell Tarikpeyma, Alimammad Novruzov, Tarana Aliyeva,\nElmaddin Dadashov, and the choir and ballet troupes of the theater\ndelighted the audience with their magnificent performances."
        ]
    }
]